Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ་དབྱངས་ལྟ་བུ་འཐོབ་བོ། །
en: They obtain the melodious voice of the kalaviṅka bird.

source: མཉམ་པ་ཉིད་ཀྱིས་རྗེས་སུ་འཐོབ་བོ། །
en: They gain attainment through equality.

source: སེང་གེའི་སྒྲ་སྒྲོགས་པ་ཡིན་ནོ། །
en: They bring forth the lion’s roar.

source: དེས་པ་ཡིན་ནོ། །
en: They are sincere.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཞུགས་ནས་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: They practice the perfection of patience and perfect great compassion.

source: བདུད་ཀྱི་ཡུལ་ལས་འདས་སོ། །
en: They go beyond the sphere of the māras.

source: དབྱངས་སྙན་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: They perfect the melodious voice.

source: ང་རྒྱལ་སྤང་བའི་ཕྱིར་བཟོད་པ་ཐོབ་བོ། །
en: “They achieve acceptance by having given up pride.

source: བསམ་གཏན་ཟབ་མོའི་བསམ་གཏན་པ་ཡིན་ནོ། །
en: They possess profound concentration.

source: འགྲོ་བ་ལས་རྒྱལ་བའི་ཆོས་སྟོན་ཏོ། །
en: They teach the Dharma that conquers the world.

source: གཏིང་ཐོབ་པ་ཡིན་ནོ། །
en: They achieve depth.

source: ཆོས་ཐམས་ཅད་ལ་སྟོབས་དང་མཐུ་ཆེ་བ་རྗེས་སུ་འཐོབ་བོ། །
en: They attain great strength and power with respect to all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ནས་ཤེས་པའི་ཕྱིར་ཤེས་པ་པོ་ཡིན་ནོ། །
en: They are full of knowledge, for they know in terms of all phenomena.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དྲན་ནོ། །
en: They are mindful of the conduct of all sentient beings.

source: བསྐལ་པ་གྲངས་མེད་པ་ནས་ཆོས་རྣམས་ཀྱི་ཆོས་དེ་བཞིན་ཉིད་མངོན་པར་རྟོགས་སོ། །
en: Over countless eons they comprehend all things just as they are.

source: རྒོལ་བ་ཐམས་ཅད་ཤེས་སོ། །
en: They know all attacks.

source: སྐྱོ་བའི་བསམ་པ་ཐམས་ཅད་སྤོང་བ་འཐོབ་བོ། །
en: They attain the relinquishment of all thoughts of weariness.

source: བྱང་ཆུབ་མྱུར་དུ་རྟོགས་སོ། །
en: They quickly attain awakening.

source: ལྷ་རྣམས་ཀྱིས་བསྟོད་དོ། །
en: They are praised by the gods.

source: ཤེས་པས་ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་གོ། །
en: They attend to all phenomena by means of knowledge.

source: དོན་ཐོབ་པར་བྱ་བ་ལ་མཁས་པ་ཡིན་ནོ། །
en: They are skilled in the achievement of meaningful objectives.

source: དེ་ལ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་སྣང་ངོ་། །
en: All phenomena appear as they truly are to them.

source: ཟས་སུ་བདུད་རྩི་ཟའོ། །
en: They partake of elixir as their food.

source: ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་དོ། །
en: “They cut through all doubts.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་འདོར་རོ། །
en: They discard all connections created by habitual tendencies.

source: སྙིང་རྗེ་ཆེན་པོས་འགེབས་སོ། །
en: They are enveloped by great compassion.

source: དགོངས་པ་དྲན་ནོ། །
en: They recollect the true intent.

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་བསྒོམ་མོ། །
en: They cultivate recollections of past lives.

source: མྱ་ངན་ལས་འདས་པའི་ཡོན་ཏན་སྤྱོད་པ་མྱུར་བར་རྟོགས་སོ། །
en: They swiftly comprehend the activities associated with the qualities of nirvāṇa.

source: ཚོགས་ཀྱིས་མཆོད་པ་བྱས་པ་འཐོབ་བོ། །
en: They attain the level of being worshiped by great gatherings.

source: ང་རྒྱལ་ཐམས་ཅད་གཅོག་གོ། །
en: They destroy all pride.

source: མཐུའི་ས་ངེས་པར་རྗེས་སུ་འཐོབ་བོ། །
en: They accomplish the level of power.

source: སྣ་ཚོགས་པ་ཉིད་ལ་འཇུག་གོ། །
en: They engage with the manifold.

source: བསྒྲུབ་པ་ཤེས་སོ། །
en: They know accomplishment.

source: སྨིན་པ་ཐམས་ཅད་ཤེས་སོ། །
en: They know all ripening.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྒྱས་པར་བྱེད་དོ། །
en: They expand the realms of the buddhas.

source: ཕུང་པོའི་བདུད་འཇོམས་སོ། །
en: They conquer the māra of the aggregates.

source: དགོངས་པའི་བཀའ་མྱུར་དུ་རྟོགས་སོ། །
en: They quickly comprehend the teaching of realization.

source: དེ་ལས་བདུད་མྱུར་དུ་རླག་པར་བྱེད་དོ། །
en: Thereby, they quickly destroy the māras.

source: ཕས་ཀྱི་རྒོལ་བ་མྱུར་དུ་འདུལ་ལོ། །
en: They quickly subdue the attacks of others.

source: འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མེད་པ་དག་ན་སངས་རྒྱས་མཐོང་ངོ་། །
en: They see buddhas in innumerable realms of the world.

source: ཆོས་ཀྱང་ཉན་ཏོ། །
en: They also listen to their Dharma.

source: དམ་པའི་ཆོས་བརྗེད་པ་མེད་དོ། །
en: They do not forget the sacred Dharma.

source: ཇི་ལྟར་བསམ་པ་བཞིན་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་རོལ་པ་བསྒྲུབ་པ་ཡང་རྗེས་སུ་འཐོབ་སྟེ།
en: They accomplish the perfection of reveling in absorption according to will.

source: ཏིང་ངེ་འཛིན་འདི་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བག་ཡོད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བརྗོད་པར་བྱའོ། །
en: Thus, as the bodhisattvas who attain this absorption are careful, they should be declared omniscient.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: འདི་ལྟར་གལ་ཏེ་དེ་འདོད་ན་སྐྱེ་བ་གཅིག་ཁོ་ནས་སམ། འདོད་ན་སྐྱེ་བ་གཉིས་སམ། གསུམ་འམ། བཞི་ནས་བསྐལ་པའི་བར་གྱིས་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །
en: Because, depending entirely on their wishes, they may within just one single life, or within two lives, or three lives, or four, or after eons, awaken to perfect buddhahood.

source: འདི་ལྟར་ཏིང་ངེ་འཛིན་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕྱིར་རོ། །
en: Because this absorption is omniscience.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །
en: Then the Blessed One spoke these verses:

source: སྟོབས་བཅུའི་སྤྱོད་པ་ཚུལ་འདི་འཛིན་པ་ནི། །
en: “Those who uphold this way of practicing the ten powers

source: མ་འཁྲུལ་མ་འཁྲུགས་འདྲ་བ་ཡོད་མིན་ལ། །
en: Are free from delusion, unshakable, and unparalleled.

source: འཆི་མེད་བདུད་རྩི་འཐོབ་ཅིང་ལྷ་ཡུལ་དང་། །
en: They attain the nectar of immortality and strive,

source: མི་ཡུལ་དཔལ་བྱེད་མཚུངས་མེད་རྩོམ་པར་འགྱུར། །
en: With matchless glory, in the realms of gods and humans.

source: སྟོབས་བཅུས་བསྟོད་པ་ཚུལ་འདི་འཛིན་པ་ནི། །
en: “Those who uphold these ways of praise through the ten powers

source: དགའ་བྱེད་ཉོན་མོངས་རྡུལ་དང་ཐ་བ་འཇོམས། །
en: Bring joy in overcoming the dirt and sod of the defilements,

source: གསལ་བའི་ཚིག་གིས་ལྷ་མི་དགའ་བར་བྱེད། །
en: And delight gods and humans with clear words.

source: རྒྱལ་བའི་ཡོན་ཏན་འོས་ཡིན་སྲིད་མུན་སེལ། །
en: Worthy of the qualities of the victors, they dispel the darkness of existence.

source: སྟོབས་བཅུ་ཐོབ་བྱ་ཕྱིར་ནི་འདི་སྤྱོད་ན། །
en: “Those who engage in this practice to attain the ten powers

source: འགྲོ་ངན་འཇོམས་ཤིང་འགྲོ་བ་ངན་ལ་མཁས། །
en: Destroy the lower realms and are expert about the lower realms.

source: ལྷ་མི་གཞན་བློ་ངན་སེལ་དགའ་བར་འགྱུར། །
en: They dispel the unwholesome orientations of gods and humans and bring them joy.

source: བློ་ལྡན་ལམ་མཁས་གཞན་སྤྱོད་རྣམ་པར་འབྱེད། །
en: They are wise path masters who discern the conduct of others.

source: ཚུལ་འདི་སྤྱོད་པ་སྲིད་འགྲོ་ཡངས་པ་སྤོང་། །
en: “Engaging in this practice, they relinquish the vast realms of existence

source: སྲིད་སོང་ལོག་པ་རྣམས་ལ་བསྐུལ་འདེབས་ཤིང་། །
en: And inspire the mistaken who have strayed there.

source: ལྷ་མི་ཇི་ལྟར་འདོད་བཞིན་སྤྱོད་བྱེད་ལ། །
en: While they act in accordance with the wishes of gods and humans,

source: མཐུ་ལྡན་དྲི་མེད་ཟླ་འདྲའི་མིག་ཏུ་འགྱུར། །
en: Such beings of power bring them vision, like unshrouded moons.

source: བྱ་བ་འདི་སྤྱོད་མཚུངས་པ་མེད་པ་ཡིན། །
en: “This practice is unequaled

source: དེ་ལ་ལྷ་མི་རྟག་ཏུ་དགའ་བར་འགྱུར། །
en: and gives constant joy to gods and humans.

source: བློ་ལྡན་སྲིད་འགྲོ་མི་དགའ་ཡུལ་འཁྲུལ་མེད། །
en: The wise who are displeased with the realms of existence, Yet not confused by objects,

source: འཁོར་ལ་སྒྲ་སྒྲོགས་ཚུལ་བརྒྱ་རྣམ་པར་འབྱེད། །
en: Reveal to their retinues hundreds of ways of proclaiming the teachings.

source: རྒྱལ་བ་ཡོན་ཏན་གྲོང་རྡལ་བདུད་རྩིའི་ཚུལ། །
en: “Those who obtain the nectar from the city of the victors’ qualities,

source: འདི་འཛིན་རང་གིས་ལེན་བཅུག་རྣམ་འབྱེད་པ། །
en: Such benefactors who adopt it and reveal it,

source: སྦྱིན་བདག་མཚན་རབ་མཛེས་པ་སུམ་ཅུ་གཉིས། །
en: Attain the thirty-two marks of beauty

source: ཐོབ་པས་ལྷ་དང་མི་རྣམས་དགའ་བར་བྱེད། །
en: And bring joy to gods and humans.

source: འདི་ལ་སྤྱོད་པ་མཐའ་འཁོབ་ཚོགས་སེལ་ཅིང་། །
en: “This practice dispels the barbarian hordes.

source: སྐྱེ་དགུ་མང་འདུལ་ཡོན་ཏན་ཕལ་ཆེན་འབྱེད། །
en: It subdues myriad beings and reveals magnificent qualities.

source: གཡོན་ཅན་ཡུལ་དང་འགྲོ་མཁས་མྱུར་བར་ནི། །
en: With swift skill regarding the māras, objects, and existences,

source: དགེ་སྦྱོང་མཆོག་འགྱུར་ལྷ་མིས་ཡོན་ཏན་བསྟོད། །
en: You are a supreme mendicant, praised by gods and humans for your qualities.

source: འཆི་མེད་ནོར་མཆོག་དག་ནི་ཐོབ་འདོད་ན། །
en: “If you wish to attain the supreme wealth of immortality,

source: སྤྱད་པ་འདི་སྤྱོད་མྱུར་དུ་རྒྱལ་བར་འགྱུར། །
en: Then engage in this practice and you will soon be victorious.

source: གྲགས་ལྡན་ཡོན་ཏན་མཆོག་ཐོབ་དྲི་བསུང་གཏོང་། །
en: With the sweet fragrance of the renowned, supreme qualities,

source: ལྷ་མི་འཇིགས་མེད་གྲོང་ཁྱེར་ཞི་བར་སྒྲོལ། །
en: You will free gods and humans from fear and peacefully liberate their cities.

source: ཚུལ་འདི་སྤྱོད་པ་འཆི་བ་མེད་ལ་དགའ། །
en: “Those who practice in this way find joy in immortality.

source: གནས་ན་གནས་ཚེ་ཕྱོགས་བཅུའི་བདེ་གཤེགས་བསྟོད། །
en: Applying themselves correctly, they praise the well-gone ones of the ten directions.

source: དེ་ནི་གཏམ་བརྗོད་ལྷ་མི་རྣམས་དགའ་ལ། །
en: They deliver discourses and delight gods and humans.

source: ཕན་འདུལ་མཉམ་གཞག་སྙན་པ་སྤྱོད་མཆོག་སྨྲ། །
en: They beautifully explain the way of benefiting, taming, and achieving equipoise.

source: ལྷ་དང་ལྷ་མིན་ས་སྟེང་སྡུག་བསྔལ་ལས། །
en: “Helping the gods and asuras who live on earth reach nirvāṇa,

source: འདའ་བར་བྱེད་ཅིང་བདུད་དཔུང་རླག་པར་བྱེད། །
en: And destroying the armies of the māras,

source: རྒྱལ་བའི་ཐད་སོང་མཆོད་བྱེད་འགྲོ་གནས་མཁས། །
en: They have come to worship the victors

source: སྲིད་འགྲོ་སྤོང་དྲན་རྟོགས་མཁས་ཡོན་ཏན་འཛིན། །
en: and are skilled in states of existence. With mindfulness they abandon existence and have qualities of expert understanding.

source: ཏིང་འཛིན་ཞི་བ་མཆོག་འདི་འཛིན་པ་ནི། །
en: “When you apprehend the supreme peace of this absorption,

source: དབང་པོ་ཞི་ཞིང་ཡེ་ཤེས་མཆོག་འཛིན་ལ། །
en: Your faculties will be serene, you will embrace supreme wisdom,

source: བསེ་རུ་ལྟ་བུ་སྤྱོད་ཅིང་ངར་མི་འཛིན། །
en: And you will practice the conduct of a rhinoceros and be free from grasping a self.

source: ཆོས་ཀྱི་སྐར་མདའ་རྟག་ཏུ་འབར་བ་འང་ཡིན། །
en: This is the ever-blazing comet of the Dharma.

source: ཡེ་ཤེས་རྒྱ་མཚོ་འདི་ནི་སྟོན་པ་དག །
en: “Those who teach this ocean of wisdom

source: དངོས་པོའི་ཚུལ་ལ་སྐད་ཅིག་པར་ཡང་རྟོགས། །
en: Realize the momentary nature of things.

source: སྲིད་གསུམ་དག་ན་འདི་ནི་གདུགས་བཞིན་ཏེ། །
en: In the three realms they are like lofty parasols,

source: ལྷ་མང་རྒྱལ་པོ་དེ་ལ་སྟོད་པར་བྱེད། །
en: Receiving the praises of the kings of the gods.

source: ཞི་བ་བལྟ་དཀའ་འདི་ལ་འབད་པ་དག །
en: “Those who exert themselves in this peace that is hard to find

source: ཉོན་མོངས་ཉམ་ཐག་དག་ནི་སེལ་བྱེད་ཅིང་། །
en: Dispel the painful emotional defilements.

source: བདེ་བར་གཤེགས་ཀྱི་འགྲོ་བར་འགོག་པ་བརྗོད། །
en: In the worlds of the well-gone ones they explain cessation,

source: ཉོན་མོངས་རྒྱུན་ཆད་སྲིད་གསུམ་འདུལ་བར་བྱེད། །
en: Interrupting the defilements and taming the three realms.

source: ཏིང་འཛིན་མཆོག་རབ་འདི་དག་ཐོབ་པ་ནི། །
en: “Those who attain this supreme absorption

source: གཞན་གྱི་སྤྱོད་པ་དྲན་ལས་བདག་གིའང་སྟེན། །
en: Are mindful of the conduct of others but also attend to their own deeds.

source: གང་གིས་བདེ་གཤེགས་མཁྱེན་པ་མང་ཤེས་ཤིང་། །
en: They develop abundant knowledge of the well-gone ones’ wisdom,

source: ཚུལ་རྣམས་ཐམས་ཅད་ལ་ནི་གནས་པ་ཡིན། །
en: And adhere to it in all its aspects.

source: འདི་བསྒྲུབ་པ་ནི་སངས་རྒྱས་རིགས་ཡིན་ཞིང་། །
en: “Those who accomplish this belong to the family of the buddhas,

source: བསྒྲུབ་པ་བྱེ་བ་མང་པོ་ཆུབ་པར་བྱེད། །
en: Perfecting many millions of attainments.

source: སྡུག་བསྔལ་ཅན་གྱི་རེག་པ་རྟག་སེལ་ཅིང་། །
en: They always alleviate painful interactions

source: མི་དེ་འཆི་བ་མེད་པ་སྟོན་པ་ཡིན། །
en: And are teachers of immortality.

source: མཐོང་དགའ་ཚིག་སྙན་ཡོན་ཏན་གྲགས་པས་འཕགས། །
en: “Exalted due to their beauty, delightful words, and renowned qualities,

source: ཡོན་ཏན་དག་གིས་ཀུན་ཏུ་མངོན་མཛེས་ལ། །
en: They are in all regards adorned with the beauty of excellent qualities.

source: འཁོར་གྱི་ནང་དུ་ཕྱིན་ན་
en: As they enter their assemblies

source: ནམ་མཁའ་ལ། །སྟོན་ཟླ་ཐ་ཆུངས་ཟླ་བ་ཉ་བ་བཞིན། །
en: They shine like the full moon in the final month of autumn.

source: ཏིང་ངེ་འཛིན་ཏེ་འདི་དག་བསྟེན་པ་ནི། །
en: “Those who adhere to this meditative absorption

source: འཁོར་བ་ན་ཡང་འཁོར་དང་ལོངས་སྤྱོད་དང་། །
en: Will, even within saṃsāra, have a retinue, enjoyments,

source: རུས་རིགས་གྲགས་པ་བདེ་བར་གཤེགས་ཀྱིས་མཁྱེན། །
en: Family line, fame, and the recognition of the well-gone ones.

source: དེ་ཡི་སྤོབས་པ་རྒྱ་མཚོ་ཇི་བཞིན་ནོ། །
en: Their eloquent acumen will be as vast as the sea.

source: རྨད་དུ་བྱུང་བའི་མདོ་འདི་སྤྱོད་པ་ནི། །
en: “Those who practice this wondrous discourse

source: ཆོས་ཀྱི་ངོ་བོ་བདག་མེད་ཚུལ་དག་ལ། །
en: Will soon realize and teach

source: རིང་པོར་མི་ཐོགས་རྟོགས་ཤིང་སྟོན་པར་བྱེད། །
en: The selfless nature of all things,

source: སྟོང་གསུམ་དག་གི་སྨན་པར་མྱུར་དུ་འགྱུར། །
en: Quickly becoming the doctor for the trichiliocosm.

source: འཆི་བ་མེད་པར་ཐོབ་པར་སྦྱོར་བ་ན། །
en: “Finding attainment beyond death, they pass beyond

source: སྟོང་གསུམ་འཇིག་རྟེན་མི་རྣམས་ཇི་སྙེད་དང་། །
en: All of humanity and all the realms of sentient beings in the trichiliocosm,

source: གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་སེམས་ཅན་ཁམས། །
en: As numerous the sand grains in the river Gaṅgā,

source: དེ་ལས་བརྒལ་ཏེ་ཡེ་ཤེས་སྒོ་ཡང་འཐོབ། །
en: And so they attain the gateways of wisdom.

source: གང་ཞིག་ལྷག་པའི་བསམ་པས་འདི་སྦྱོར་བ། །
en: “Whoever engages in this practice with superior intent

source: དུག་དང་མཚོན་དང་མེས་ཀྱང་མི་ཚུགས་ཤིང་། །
en: Becomes immune to poison, weapons, and fire,

source: རྒྱལ་པོས་བཀྲབས་ལྟུང་ཁུ་སྒོའི་འཇིགས་པའང་མེད། །
en: And will not fear being arrested and punished by the king.

source: རྒྱལ་པོ་སྲིན་པོའི་འཇིགས་པའང་འབྱུང་མི་འགྱུར། །
en: They know no fear of kings or rākṣasas.

source: ཚིག་བཞི་པོ་ནི་འཛིན་པར་བྱེད་པ་ན། །
en: “As they retain the four words,

source: ཁྱིམ་ནས་འཆི་མེད་ནོར་ཆུད་ཟོས་མི་འགྱུར། །
en: They leave the household and do not waste the wealth of immortality.

source: མེ་དང་སྐེམས་དང་གདོན་གྱིས་མི་ཚུགས་ཤིང་། །
en: They are not affected by fire, famine, or evil influence.

source: ལོང་དང་ཞར་དང་རྨོངས་པར་མི་འགྱུར་རོ། །
en: They do not become blind, deaf, or confused.

source: ཏིང་འཛིན་ཞི་བ་འདི་ལ་སྦྱོར་བྱེད་པ། །
en: “Those who practice this peaceful absorption

source: དེ་ལ་གང་དག་གཟུངས་ཀྱི་གཏེར་ཡང་སྩོལ། །
en: Will receive the treasure of retention.

source: གང་ཞིག་འདི་སྦྱོར་དེ་ཚེ་བདེ་བར་གཤེགས། །
en: Whoever practices this receives at that point

source: བྱེ་བ་དྲུག་ཅུ་གཉིས་པོའང་དགོངས་པར་འགྱུར། །
en: The attention of six hundred and twenty million well-gone ones.

source: གལ་ཏེ་བྱང་ཆུབ་མྱུར་དུ་རེག་འདོད་ཅིང་། །
en: “If you wish to quickly reach awakening,

source: གལ་ཏེ་ཡོན་ཏན་ཞིང་མཆོག་འདོད་བྱེད་པས། །
en: And if you wish for the supreme field of qualities,

source: མདོ་མཆོག་ཚུལ་འདི་ལ་ནི་སྦྱོར་བ་ན། །
en: Practice the way of this supreme discourse,

source: ཐམས་ཅད་མཁྱེན་པ་དེ་ཡི་ལག་ཏུ་འཐོབ། །
en: And omniscience will be in the palm of your hand.

source: དེ་བས་མཉན་ཏེ་འདིར་ནི་སེམས་ཅན་གང་། །
en: “Therefore, any sentient being who listens to this

source: བྱང་ཆུབ་དོན་དུ་དགེ་ལ་དགའ་བྱ་ན། །
en: And delights in virtue for the sake of awakening

source: ཞག་བཞིའི་བར་དུ་ལེགས་པར་བརྩོན་བྱས་པས། །སྟོབས་བཅུ་དག་གི་ནོར་ནི་འཐོབ་པར་འགྱུར། །
en: Will attain the treasure of the ten powers By applying themselves to this for four days.

source: ཏིང་འཛིན་མཆོག་མ་ལ་ནི་འཇུག་བྱེད་པ། །རྐང་གཉིས་མཆོག་མ་བྱེ་བ་བརྒྱད་ཅུ་དང་། །གཞན་ཡང་རྒྱལ་བ་ཁྲག་ཁྲིག་དྲུག་ཅུ་རྣམས། །གང་དག་དེ་ལ་རྟག་ཏུ་དགོངས་པར་འགྱུར། །
en: “Those who enter this supreme absorption Will receive the constant attention Of eight hundred million of the supreme among the two-legged, As well as six hundred billion other victorious ones.

source: གང་གིས་མཉན་པ་རྙེད་པ་ལེགས་རྙེད་ལ། །
en: “Those who listen to this teaching, obtain it well,

source: འདི་མཉན་ནས་ཀྱང་འདི་ལ་མོས་བྱས་པ། །
en: And become inspired by listening

source: དེ་དག་ཡིད་གཉིས་སྤོངས་ཏེ་བྱང་ཆུབ་ལ། །
en: Will give up uncertainty and achieve awakening;

source: དེ་དག་ཐེ་ཙོམ་འཁོར་བར་ཕྱིར་མི་མཐོང་། །
en: They will no longer have doubts or meet with saṃsāra.

source: དེ་བས་མཉན་ཏེ་ཡང་དག་སྤྱོད་འདི་ལ། །
en: “Those who listen to and correctly practice this discourse

source: བརྩོན་དང་ཡོན་ཏན་དག་ལ་དགའ་བྱ་ན། །
en: With diligence and appreciation for its qualities,

source: མདོ་འདི་བྲིས་ནས་ཀྱང་ནི་འཆང་བྱེད་པ། །
en: Who write this discourse down and bear it,

source: ཐམས་ཅད་མཁྱེན་ཉིད་ངེས་པར་ལག་ཏུ་འཐོབ། །
en: Are certain to find omniscience in the palms of their hands.

source: ངས་མངོན་ཤེས་ཏེ་བསྐལ་པ་བརྒྱ་འདས་ན། །
en: “With superknowledge I see that one hundred eons ago

source: སྤོབས་པའི་ཏོག་ཅེས་བྱ་བའི་རྒྱལ་བ་བྱུང་། །
en: There appeared a victorious one known as Crest Ornament of Eloquence.

source: དེ་ནི་ཏིང་འཛིན་མཆོག་འདི་བསྟན་པ་དག །
en: He taught this supreme absorption

source: རྒྱལ་པོའི་བུ་སྟེ་ཟླ་བ་དཔལ་གྱིས་མཉན། །
en: And the prince, Moon of Glory, listened.

source: རྒྱལ་སྲིད་སྤངས་ནས་མྱུར་བར་རབ་བྱུང་སྟེ། །
en: “The prince abandoned his kingdom and soon went forth,

source: དེས་ནི་ཉིན་མཚན་གཅིག་ཏུ་མཉན་ནས་ཀྱང་། །
en: Listening keenly throughout day and night.

source: དེ་ཐུན་ཐ་མ་དག་ལ་དུས་ལས་འདས། །
en: In his final session, he passed away

source: ཞིང་གཞན་དག་ཏུ་དེ་ནི་རྫུས་ཏེ་སྐྱེས། །
en: And then took miraculous birth in a different realm.

source: ཇི་ལྟར་གང་གཱའི་བྱེ་མ་དེ་བས་ཀྱང་། །
en: “There he worshiped the incomparable one for more days

source: མང་བའི་ཞག་ཏུ་མཚུངས་པ་མེད་ལ་མཆོད། །
en: Than there are grains of sand in the Gaṅgā.

source: བྱང་ཆུབ་རྗེས་སུ་དེ་རྟོགས་བྱ་བའི་ཕྱིར། །
en: And for the sake of realizing awakening

source: ཀུན་ལས་ཏིང་ངེ་འཛིན་འདི་བསྐལ་པར་མཉན། །
en: He immersed himself in listening to this absorption for an eon.

source: རྒྱལ་བ་མར་མེ་མཛད་ལུང་སྟོན་པ་གང་། །
en: “As prophesied by the victorious Dīpaṅkara,

source: རིན་ཆེན་གཙུག་ཏོར་ཞེས་བྱའི་རྒྱལ་དེ་བྱུང་། །
en: He became the victor known as Jewel Crown Ornament.

source: དེ་ལྟར་འདི་ཐོས་འབྲས་བུ་ཆེ་བས་ན། །
en: Hence, since the effects of hearing this are great,

source: དེ་ཕྱིར་ཐོས་ནས་ལེ་ལོར་མི་བྱའོ། །
en: Do not be lazy once you have heard it.

source: ལྷ་མི་རྣམས་ལ་སྙན་པའི་དབྱངས་དག་གིས། །
en: “With beautiful melodies, bring gods and humans

source: རབ་ཏུ་རྟོགས་པར་བྱ་ཞིང་མཆོད་བྱ་ལ། །
en: To clear understanding and veneration.

source: ངས་ནི་རིན་ཆེན་གཏེར་དག་ཕྱེ་ཟིན་གྱིས། །
en: Remember my explanation of this precious treasure.

source: སྟོབས་བཅུ་པོ་ཡི་ནོར་འདི་གཟུང་བར་གྱིས། །
en: Retain this jewel of the ten powers.

source: མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པའི་ཡང་ཆེས་གྲངས་མེད་པ་བྱུང་བ་དེའི་ཚེ་དེའི་དུས་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོབས་པའི་རྒྱན་བཀོད་པའི་དབྱངས་ཀྱི་ང་རོ་སྙན་པར་འབྲུག་སྒྲ་སྒྲོགས་པ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Prāmodyarāja, in the past—innumerable, uncountable eons before—there appeared a thus-gone one, a worthy one, a complete and perfect buddha known as Proclaimer of the Melodious Thundering Roar of the Ornamental Beauty of Eloquence.

source: དེའི་གསུང་རབ་ལ་ཆོས་སྨྲ་བ་སྤོབས་པ་མཐའ་ཡས་པའི་ཡོན་ཏན་ཏོག་གི་རྒྱལ་མཚན་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ནས་
en: Among the propagators of his Dharma teachings was a teacher known as Crest of the Banner of the Qualities of Infinite Eloquence.

source: དེ་ཏིང་ངེ་འཛིན་འདི་སྟོན་པའི་ཚེ། རྒྱལ་པོའི་བུ་སྐྱེ་བོ་མང་པོ་ལ་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་དག་པར་སྒྲ་སྒྲོགས་པས་འབུམ་རི་བའི་གོས་གྱོན་གྱོན་པ་བསྐོན་ཏེ།
en: When he taught this absorption, a prince known as Teaching the Dharma to Many as the Pure Ripening of Merit offered a precious and priceless garment,

source: འདི་སྙམ་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཏིང་ངེ་འཛིན་འདི་ཐོབ་པར་གྱུར་ཅིག་ཅེས་སེམས་བསྐྱེད་དོ། །
en: and at the same time aroused the attitude of thinking ‘May all sentient beings achieve this absorption!’

source: དེ་དགེ་བའི་རྩ་བ་དེས་ན་གང་གཱའི་ཀླུང་བརྒྱད་ཅུའི་བྱེ་མ་དང་མཉམ་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་དགྱེས་པར་བྱས་ནས།
en: “By the roots of virtue ensuing from this, he delighted thus-gone ones more numerous than the grains of sand found in eighty Gaṅgā Rivers.

source: ཐམས་ཅད་ལས་ཏིང་ངེ་འཛིན་འདི་མཉན་ཏེ།
en: From all those blessed ones he received this absorption,

source: མ་བསྟན་པའི་ཆོས་ཐམས་ཅད་ཀྱང་སྣང་ངོ་། །
en: and Dharma teachings that had not been taught before appeared.

source: རྟག་ཏུ་རྫུས་ཏེ་བྱུང་བར་གྱུར་པའི་སྐྱེ་བའང་དྲན་ནོ། །
en: He then recollected his continuous miraculous births.

source: རྒྱལ་པོའི་བུ་སྐྱེ་བོ་མང་པོ་ལ་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་དག་པར་སྒྲ་སྒྲོགས་པ་དེ།
en: This prince, Teaching the Dharma to Many as the Pure Ripening of Merit,

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོན་ཏན་དཔག་ཏུ་མེད་པ་བཀོད་པར་ཚེ་དཔག་མེད་ཅེས་བྱ་བར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ཏོ། །
en: attained perfect awakening and, in the buddha realm known as Aparimita­guṇa­vyūha, became known as the buddha Amitāyus.

source: དགེ་སློང་ཆོས་སྨྲ་བ་སྤོབས་པ་མཐའ་ཡས་པའི་ཡོན་ཏན་ཏོག་གི་རྒྱལ་མཚན་རྣམ་པར་འཕྲུལ་པའི་ང་རོ་ཞེས་བྱ་བ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་སྤྱན་ཆེན་པོ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: The monk and Dharma teacher called Crest of the Banner of the Qualities of Infinite Eloquence became the thus-gone one known as Great Eye.

source: རྒྱལ་པོའི་བུ་དེས་ཏིང་ངེ་འཛིན་འདི་ཐོས་ནས་བསྐལ་པ་འབུམ་ཕྲག་བདུན་ཅུར་མངོན་པར་འདུས་བྱས་པའི་ལས་ཀྱི་སྒྲིབ་པ་རྣམས་སྤངས་སོ། །
en: “When the prince had heard this absorption, he relinquished the karmic obscurations created during seven million eons.

source: རྣམ་པར་འབྱེད་པའི་ལེའུ་དང་། སྒོ་མཐའ་ཡས་པས་བསྒྲུབས་པའི་གཟུངས་དང་ཡང་སྐྱེ་བ་ཐམས་ཅད་དུ་མ་བྲལ་ཏེ། ཆུང་ངུ་ན་སེ་གོལ་གཏོགས་པ་ཙམ་ཡང་མ་བྲལ་བར་གྱུར་ཏོ། །
en: In all his lives he never parted—even for just as long as it takes to snap one’s fingers—from the retention accomplished through the differentiating sections and infinite gateways.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་ཞལ་གསལ་ཟླ་བ་དྲི་མ་མེད་པའི་དཔལ་གྱི་སྙིང་པོ་གཟི་བརྗིད་ཅེས་བྱ་བ་བྱུང་སྟེ། དེས་དེ་ལ་ཏིང་ངེ་འཛིན་འདི་བསྟན་ཅིང་བཤད་པ་ན།
en: “There was also a thus-gone one known as Bright Countenance Like the Stainless Moon of the Essence of Glorious Splendor who taught and explained this absorption.

source: ཚོང་དཔོན་གྱི་བུ་རྒྱ་ཆེར་མཛེས་ཤིང་བཀོད་པ་ལེགས་སེམས་ཀྱིས་དེ་ལས་མཉན་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ། ཆུང་མ་བདུན་ཅུ་དང་། དཔག་ཚད་གཅིག་ཁོར་ཡུག་ཙམ་གྱི་གཏེར་བཞི་དང་། སྐྱེད་མོས་ཚལ་བརྒྱ་ཕྲག་བཅྭ་བརྒྱད་དག་སྤངས་ནས་
en: When the son of a merchant, Vast Beauty and Fine Shape, listened to this teaching with his mind, he went forth from the household, abandoning seventy wives, a treasury that covered a league, and one thousand eight hundred gardens.

source: དེ་གོས་བཀྲམ་པའི་ས་གཞི་ལ་རྐང་པ་ནམ་ཡང་འཇོག་པར་མ་གྱུར་ཏོ། །
en: He never again set his foot on ground covered with fabric.

source: དེ་རབ་ཏུ་བྱུང་ནས་ལོ་ཁྲིའི་བར་དུ་བཤང་གཅི་དང་གྲལ་མ་གཏོགས་པར་ནམ་ཡང་འདུག་པ་དང་མཆིལ་ལྷམ་བགོས་པ་མ་མྱོང་སྟེ།
en: For ten thousand years after he had gone forth, he never wore footwear except in the latrine,

source: རྨུགས་པ་དང་གཉིད་དང་བྲལ་ནས་འཆག་པ་ལ་མངོན་དུ་བརྩོན་པར་གྱུར་ཏོ། །
en: but kept diligently on the move, free from drowsiness and sleep.

source: དེ་ལོ་ཁྲི་པོ་དེ་དག་འདས་ནས་
en: When ten thousand years had passed,

source: དེས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བཀའ་དང་ངེས་པའི་ཚིག་དང་དབྱངས་སྡུད་པ་ཞེས་བྱ་བའི་གཟུངས་དང་།
en: he obtained the retention known as embodiment of the teachings, statements, and voices of all the buddhas,

source: སྒྲ་ཐམས་ཅད་ལ་འཇུག་པར་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་སྟེ
en: and he accomplished the absorption known as comprehending the use of all language.

source: དེ་ལ་ལྷ་དྲུག་འབུམ་སྙེད་པོ་དེ་དག་ཀྱང་བསྙེན་བཀུར་བྱེད་པ་ལ་བརྩོན་པར་གྱུར་ཏོ། །
en: Receiving the veneration of six hundred thousand gods, he kept endeavoring.

source: ལུས་དང་སེམས་མཆོག་ཏུ་དགེ་བར་བསྒྲུབ་པའི་ཚེ།
en: Now that he has accomplished virtue by body and mind,

source: ལྷོ་ཕྱོགས་ན་འཇིག་རྟེན་གྱི་ཁམས་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པར་དེ་བཞིན་གཤེགས་པ་ཡིད་འཐད་ཅེས་བྱ་བར་ད་ལྟར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།། །།
en: he resides in a world to the south that is adorned with all excellent qualities. There he has now truly awakened as a buddha and he is known as the thus-gone Reasoning Mind.”

source: དཔེར་ན་གང་གཱའི་བྱེ་མ་སྙེད། །བསྐལ་པ་མཐའ་ཡས་དྲན་གྱུར་ཏེ། །
en: “I recollect eons more numerous, by comparison, Than the sands in the river Gaṅgā.
